FreeRTOS/FreeRTOS-Plus-TCP/source/portable/NetworkInterface/STM32/NetworkInterface.c
    pxEthHandle->Init.RxBuffLen = niEMAC_DATA_BUFFER_SIZE;
    configASSERT( pxEthHandle->Init.RxBuffLen <= ETH_MAX_PACKET_SIZE );
    configASSERT( pxEthHandle->Init.RxBuffLen % 4U == 0 );

    static ETH_DMADescTypeDef xDMADescRx[ ETH_RX_DESC_CNT ] __ALIGNED( portBYTE_ALIGNMENT ) __attribute__( ( section( niEMAC_RX_DESC_SECTION ) ) );
    static ETH_DMADescTypeDef xDMADescTx[ ETH_TX_DESC_CNT ] __ALIGNED( portBYTE_ALIGNMENT ) __attribute__( ( section( niEMAC_TX_DESC_SECTION ) ) );

    pxEthHandle->Init.TxDesc = xDMADescTx;
    pxEthHandle->Init.RxDesc = xDMADescRx;

    ( void ) memset( &xDMADescTx, 0, sizeof( xDMADescTx ) );
    ( void ) memset( &xDMADescRx, 0, sizeof( xDMADescRx ) );

    const NetworkEndPoint_t * const pxEndPoint = FreeRTOS_FirstEndPoint( pxInterface );
    if( pxEndPoint != NULL )
    {
        pxEthHandle->Init.MACAddr = ( uint8_t * ) pxEndPoint->xMACAddress.ucBytes;

        #if defined( STM32F7 ) || defined( STM32F4 )
            /* This function doesn't get called in Fxx driver */
            HAL_ETH_SetMDIOClockRange( pxEthHandle );
        #endif

        if( HAL_ETH_Init( pxEthHandle ) == HAL_OK )
        {
            xResult = pdTRUE;
        }
        /* else
        {
            pxEthHandle->ErrorCode & HAL_ETH_ERROR_TIMEOUT
        } */
    }

    /*
    ETH_DMAConfigTypeDef xDMAConfig;
    ( void ) HAL_ETH_GetDMAConfig( pxEthHandle, &xDMAConfig );
    xDMAConfig.
    if( HAL_ETH_SetDMAConfig( pxEthHandle, &xDMAConfig ) != HAL_OK )
    {
        break;
    }
    */

    /* #if ( ( defined( STM32H5 ) || defined ( STM32H7 ) ) && ipconfigIS_ENABLED( ipconfigETHERNET_DRIVER_FILTERS_PACKETS ) )
        prvUpdatePacketFilter( pxEthHandle, pxInterface );
    #endif */

    return xResult;
}

/*---------------------------------------------------------------------------*/

static void prvInitMACAddresses( ETH_HandleTypeDef * pxEthHandle, NetworkInterface_t * pxInterface )
{
    for( NetworkEndPoint_t * pxEndPoint = FreeRTOS_FirstEndPoint( pxInterface ); pxEndPoint != NULL; pxEndPoint = FreeRTOS_NextEndPoint( pxInterface, pxEndPoint ) )
    {
        prvMACAddressConfig( pxEthHandle, pxEndPoint->xMACAddress.ucBytes );
    }

    #if ( ipconfigIS_ENABLED( ipconfigUSE_MDNS ) )
        #if ( ipconfigIS_ENABLED( ipconfigUSE_IPv4 ) )
            prvMACAddressConfig( pxEthHandle, xMDNS_MacAddress.ucBytes );
        #endif
        #if ( ipconfigIS_ENABLED( ipconfigUSE_IPv6 ) )
            prvMACAddressConfig( pxEthHandle, xMDNS_MACAddressIPv6.ucBytes );
        #endif
    #endif

    #if ( ipconfigIS_ENABLED( ipconfigUSE_LLMNR ) )
        #if ( ipconfigIS_ENABLED( ipconfigUSE_IPv4 ) )
            prvMACAddressConfig( pxEthHandle, xLLMNR_MacAddress.ucBytes );
        #endif
        #if ( ipconfigIS_ENABLED( ipconfigUSE_IPv6 ) )
            prvMACAddressConfig( pxEthHandle, xLLMNR_MacAddressIPv6.ucBytes );
        #endif
    #endif

    #if ( ipconfigIS_ENABLED( ipconfigUSE_IPv6 ) )
        prvMACAddressConfig( pxEthHandle, pcLOCAL_ALL_NODES_MULTICAST_MAC.ucBytes );
    #endif

    /* for( NetworkEndPoint_t * pxEndPoint = FreeRTOS_FirstEndPoint( pxInterface ); pxEndPoint != NULL; pxEndPoint = FreeRTOS_NextEndPoint( pxInterface, pxEndPoint ) )
    {
        #if ( ipconfigIS_ENABLED( ipconfigUSE_IPv6 ) )
            if( pxEndPoint->bits.bIPv6 != pdFALSE_UNSIGNED )
            {
                const uint8_t ucMACAddress[ ipMAC_ADDRESS_LENGTH_BYTES ] = {
                    0x33,
                    0x33,
                    0xff,
                    pxEndPoint->ipv6_settings.xIPAddress.ucBytes[ 13 ],
                    pxEndPoint->ipv6_settings.xIPAddress.ucBytes[ 14 ],
                    pxEndPoint->ipv6_settings.xIPAddress.ucBytes[ 15 ]
                };
                prvMACAddressConfig( pxEthHandle, ucMACAddress );
            }
        #else
            if( pxEthHandle->Init.MACAddr != ( uint8_t * ) pxEndPoint->xMACAddress.ucBytes )
            {
                prvMACAddressConfig( pxEthHandle, pxEndPoint->xMACAddress.ucBytes );
            }
        #endif
    } */

    #if ( ipconfigIS_ENABLED( ipconfigUSE_IPv6 ) )
        prvMACAddressConfig( pxEthHandle, pcLOCAL_ALL_NODES_MULTICAST_MAC.ucBytes );
    #endif

    /* TODO: Move this into prvMACAddressConfig? Also determine changes that need to be done based on added/removed allowed MAC address */
    /* #if ( ipconfigIS_ENABLED( ipconfigETHERNET_DRIVER_FILTERS_FRAME_TYPES ) )
        prvUpdateFrameFilter( pxEthHandle, pxInterface );
    #endif */
}

/*---------------------------------------------------------------------------*/

static BaseType_t prvPhyStart( ETH_HandleTypeDef * pxEthHandle, NetworkInterface_t * pxInterface, EthernetPhy_t * pxPhyObject )
{
    BaseType_t xResult = pdFALSE;

    if( prvGetPhyLinkStatus( pxInterface ) == pdFALSE )
    {
        const PhyProperties_t xPhyProperties = {
            #if ( ipconfigIS_ENABLED( niEMAC_AUTO_NEGOTIATION ) )
                .ucSpeed = PHY_SPEED_AUTO,
                .ucDuplex = PHY_DUPLEX_AUTO,
            #else
                .ucSpeed = ipconfigIS_ENABLED( niEMAC_USE_100MB ) ? PHY_SPEED_100 : PHY_SPEED_10,
                .ucDuplex = ipconfigIS_ENABLED( niEMAC_USE_FULL_DUPLEX ) ? PHY_DUPLEX_FULL : PHY_DUPLEX_HALF,
            #endif

            #if ( ipconfigIS_ENABLED( niEMAC_AUTO_CROSS ) )
                .ucMDI_X = PHY_MDIX_AUTO,
            #elif ( ipconfigIS_ENABLED( niEMAC_CROSSED_LINK ) )
                .ucMDI_X = PHY_MDIX_CROSSED,
            #else
                .ucMDI_X = PHY_MDIX_DIRECT,
            #endif
        };

        if( xPhyConfigure( pxPhyObject, &xPhyProperties ) == 0 )
        {
            if( prvMacUpdateConfig( pxEthHandle, pxPhyObject ) != pdFALSE )
            {
                xResult = pdTRUE;
            }
        }
    }
    else
    {
        xResult = pdTRUE;
    }

    return xResult;
}

/*===========================================================================*/
/*                             MAC Helpers                                   */
/*===========================================================================*/

static BaseType_t prvMacUpdateConfig( ETH_HandleTypeDef * pxEthHandle, EthernetPhy_t * pxPhyObject )
{
    BaseType_t xResult = pdFALSE;

    if( pxEthHandle->gState == HAL_ETH_STATE_STARTED )
    {
        ( void ) HAL_ETH_Stop_IT( pxEthHandle );
    }

    ETH_MACConfigTypeDef xMACConfig;
    ( void ) HAL_ETH_GetMACConfig( pxEthHandle , &xMACConfig );
    xMACConfig.ChecksumOffload = ( FunctionalState ) ipconfigIS_ENABLED( ipconfigDRIVER_INCLUDED_RX_IP_CHECKSUM );

