FreeRTOS/FreeRTOS-Plus-TCP/source/portable/NetworkInterface/STM32/NetworkInterface.c
    #if ( ipconfigIS_ENABLED( niEMAC_AUTO_NEGOTIATION ) )
        /* TODO: xPhyStartAutoNegotiation always returns 0, Should return -1 if xPhyGetMask == 0 ? */
        ( void ) xPhyStartAutoNegotiation( pxPhyObject, xPhyGetMask( pxPhyObject ) );
        xMACConfig.DuplexMode = ( pxPhyObject->xPhyProperties.ucDuplex == PHY_DUPLEX_FULL ) ? ETH_FULLDUPLEX_MODE : ETH_HALFDUPLEX_MODE;
        xMACConfig.Speed = ( pxPhyObject->xPhyProperties.ucSpeed == PHY_SPEED_10 ) ? ETH_SPEED_10M : ETH_SPEED_100M;
    #else
        pxPhyObject->xPhyPreferences.ucSpeed = ipconfigIS_ENABLED( niEMAC_USE_100MB ) ? PHY_SPEED_100 : PHY_SPEED_10;
        pxPhyObject->xPhyPreferences.ucDuplex = ipconfigIS_ENABLED( niEMAC_USE_FULL_DUPLEX ) ? PHY_DUPLEX_FULL : PHY_DUPLEX_HALF;
        /* ucMDI_X unused */
        /* TODO: xPhyFixedValue always return 0 */
        ( void ) xPhyFixedValue( pxPhyObject, xPhyGetMask( pxPhyObject ) );
        xMACConfig.DuplexMode = pxPhyObject->xPhyPreferences.ucDuplex;
        xMACConfig.Speed = pxPhyObject->xPhyPreferences.ucSpeed;
    #endif

    if( HAL_ETH_SetMACConfig( pxEthHandle, &xMACConfig ) == HAL_OK )
    {
        xResult = pdTRUE;
    }

    return xResult;
}

/*---------------------------------------------------------------------------*/

/* Compute the CRC32 of the given MAC address as per IEEE 802.3 CRC32 */
static uint32_t prvComputeCRC32_MAC( const uint8_t * pucMAC )
{
    uint32_t ulCRC32 = 0xFFFFFFFF;

    for( UBaseType_t i = 0; i < 6; ++i )
    {
        ulCRC32 ^= ( uint32_t ) pucMAC[ i ];

        for( UBaseType_t j = 0; j < 8; ++j )
        {
            ulCRC32 >>= 1;
            if( ulCRC32 & 1 )
            {
                /* IEEE 802.3 CRC32 polynomial - 0x04C11DB7 */
                ulCRC32 ^= __RBIT( 0x04C11DB7 );
            }
        }
    }

    ulCRC32 = ~( ulCRC32 );
    return ulCRC32;
}

/*---------------------------------------------------------------------------*/

/* Compute the hash value of a given MAC address to index the bits in the Hash Table */
static uint32_t prvComputeEthernet_MACHash( const uint8_t * pucMAC )
{
    /* Calculate the 32-bit CRC for the MAC */
    const uint32_t ulCRC32 = prvComputeCRC32_MAC( pucMAC );

    /* Perform bitwise reversal on the CRC32 */
    const uint32_t ulHash = __RBIT( ulCRC32 );

    /* Take the upper 6 bits of the above result */
    return ( ulHash >> 26 );
}

/*---------------------------------------------------------------------------*/

/* Update the Hash Table Registers with hash value of the given MAC address */
static void prvSetMAC_HashFilter( ETH_HandleTypeDef * pxEthHandle, const uint8_t * pucMAC )
{
    static uint32_t ulHashTable[ 2 ];

    const uint32_t ulHash = prvComputeEthernet_MACHash( pucMAC );

    /* Use the upper or lower Hash Table Registers
     * to set the required bit based on the ulHash */
    if( ulHash < 32 )
    {
        ulHashTable[ 0 ] = ulHash;
    }
    else
    {
        ulHashTable[ 1 ] = ulHash;
    }

    ( void ) HAL_ETH_SetHashTable( pxEthHandle, ulHashTable );
}

/*---------------------------------------------------------------------------*/

static void prvMACAddressConfig( ETH_HandleTypeDef * pxEthHandle, uint8_t * pucAddr )
{
    /* ETH_MAC_ADDRESS0 reserved for the primary MAC-address. */
    static UBaseType_t uxMACEntry = ETH_MAC_ADDRESS1;

    switch( uxMACEntry )
    {
        case ETH_MAC_ADDRESS1:
            ( void ) HAL_ETH_SetSourceMACAddrMatch( pxEthHandle, uxMACEntry, pucAddr );
            uxMACEntry = ETH_MAC_ADDRESS2;
            break;

        case ETH_MAC_ADDRESS2:
            ( void ) HAL_ETH_SetSourceMACAddrMatch( pxEthHandle, uxMACEntry, pucAddr );
            uxMACEntry = ETH_MAC_ADDRESS3;
            break;

        case ETH_MAC_ADDRESS3:
            ( void ) HAL_ETH_SetSourceMACAddrMatch( pxEthHandle, uxMACEntry, pucAddr );
            uxMACEntry = ETH_MAC_ADDRESS0;
            break;

        case ETH_MAC_ADDRESS0:
            prvSetMAC_HashFilter( pxEthHandle, pucAddr );
            break;

        default:
            break;
    }

    /* #if ( ipconfigIS_ENABLED( ipconfigETHERNET_DRIVER_FILTERS_FRAME_TYPES ) )
        prvUpdateFrameFilter( pxEthHandle, pxInterface );
    #endif */
}

/*===========================================================================*/
/*                           Filter Helpers                                  */
/*===========================================================================*/

#if 0

#if ( ipconfigIS_ENABLED( ipconfigETHERNET_DRIVER_FILTERS_FRAME_TYPES ) )

static void prvUpdateFrameFilter( ETH_HandleTypeDef * pxEthHandle, NetworkInterface_t * pxInterface )
{
    ETH_MACFilterConfigTypeDef xFilterConfig;
    ( void ) HAL_ETH_GetMACFilterConfig( pxEthHandle, &xFilterConfig );

    /* xFilterConfig.PromiscuousMode = DISABLE;
    xFilterConfig.ReceiveAllMode = DISABLE;
    xFilterConfig.HachOrPerfectFilter = ENABLE;
    xFilterConfig.HashUnicast = ENABLE;
    xFilterConfig.HashMulticast = ENABLE;
    xFilterConfig.PassAllMulticast = DISABLE;
    xFilterConfig.SrcAddrFiltering = ENABLE;
    xFilterConfig.SrcAddrInverseFiltering = DISABLE;
    xFilterConfig.DestAddrInverseFiltering = DISABLE;
    xFilterConfig.BroadcastFilter = DISABLE;
    xFilterConfig.ControlPacketsFilter = DISABLE; */

    ( void ) HAL_ETH_SetMACFilterConfig( pxEthHandle, &xFilterConfig );
}

#endif /* if ( ipconfigIS_ENABLED( ipconfigETHERNET_DRIVER_FILTERS_FRAME_TYPES ) ) */

#endif /* if 0 */


/*---------------------------------------------------------------------------*/

#if 0

#if ( ( defined( STM32H5 ) || defined ( STM32H7 ) ) && ipconfigIS_ENABLED( ipconfigETHERNET_DRIVER_FILTERS_PACKETS ) )

/* TODO: Where to put this? Should it be triggered by a NetworkInterface_t hook? */
static void prvUpdatePacketFilter( ETH_HandleTypeDef * pxEthHandle, NetworkInterface_t * pxInterface )
{
    HAL_ETHEx_DisableL3L4Filtering( pxEthHandle );

    ETH_L3FilterConfigTypeDef xL3FilterConfig;
    ( void ) HAL_ETHEx_GetL3FilterConfig( pxEthHandle, ETH_L3_FILTER_0, &xL3FilterConfig );

    xL3FilterConfig.Protocol = ETH_L3_IPV4_MATCH/ETH_L3_IPV6_MATCH;
    xL3FilterConfig.SrcAddrFilterMatch = ETH_L3_SRC_ADDR_PERFECT_MATCH_ENABLE/ETH_L3_SRC_ADDR_INVERSE_MATCH_ENABLE/ETH_L3_SRC_ADDR_MATCH_DISABLE;
    xL3FilterConfig.DestAddrFilterMatch = ETH_L3_DEST_ADDR_PERFECT_MATCH_ENABLE/ETH_L3_DEST_ADDR_INVERSE_MATCH_ENABLE/ETH_L3_DEST_ADDR_MATCH_DISABLE;
    xL3FilterConfig.SrcAddrHigherBitsMatch = ;
    xL3FilterConfig.DestAddrHigherBitsMatch = ;
    #if ( ipconfigIS_ENABLED( ipconfigUSE_IPv4 ) )
        xL3FilterConfig.Ip4SrcAddr = ;
        xL3FilterConfig.Ip4DestAddr = ;
    #endif
    #if ( ipconfigIS_ENABLED( ipconfigUSE_IPv6 ) )
        xL3FilterConfig.Ip6Addr = ;
    #endif

    ( void ) HAL_ETHEx_SetL3FilterConfig( pxEthHandle, ETH_L3_FILTER_0, &xL3FilterConfig );


    ETH_L4FilterConfigTypeDef xL4FilterConfig;
    ( void ) HAL_ETHEx_GetL4FilterConfig( pxEthHandle, ETH_L4_FILTER_0, &xL4FilterConfig );

    xL4FilterConfig.Protocol = ETH_L4_UDP_MATCH/ETH_L4_TCP_MATCH;
    xL4FilterConfig.SrcPortFilterMatch = ETH_L4_SRC_PORT_PERFECT_MATCH_ENABLE/ETH_L4_SRC_PORT_INVERSE_MATCH_ENABLE/ETH_L4_SRC_PORT_MATCH_DISABLE;
    xL4FilterConfig.DestPortFilterMatch = ETH_L4_DEST_PORT_PERFECT_MATCH_ENABLE/ETH_L4_DEST_PORT_INVERSE_MATCH_ENABLE/ETH_L4_DEST_PORT_MATCH_DISABLE;
    xL4FilterConfig.SourcePort = ;
    xL4FilterConfig.DestinationPort = ;

    ( void ) HAL_ETHEx_SetL4FilterConfig( pxEthHandle, ETH_L4_FILTER_0, &xL4FilterConfig );

